MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E1053CNH/mcu.h
typedef struct                         /*!< (@ 0x400A3B00) R_PCLBUZ Structure                                         */
{
    __IM uint8_t RESERVED;

    union
    {
        __IOM uint8_t CKS[2];          /*!< (@ 0x00000001) Clock Out Control Register [0..1]                          */

        struct
        {
            __IOM uint8_t CCS   : 3;   /*!< [2..0] Clock Out Divide Select                                            */
            __IOM uint8_t CSEL  : 1;   /*!< [3..3] Clock Out Select                                                   */
            uint8_t             : 3;
            __IOM uint8_t PCLOE : 1;   /*!< [7..7] Clock Out Enable                                                   */
        } CKS_b[2];
    };
} R_PCLBUZ_Type;                       /*!< Size = 3 (0x3)                                                            */

/* =========================================================================================================================== */
/* ================                                          R_PORT0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief I/O Ports (R_PORT0)
 */

typedef struct                         /*!< (@ 0x400A0000) R_PORT0 Structure                                          */
{
    union
    {
        __IOM uint16_t PODR;           /*!< (@ 0x00000000) Pmn Output Data Register                                   */

        struct
        {
            __IOM uint16_t PODR0  : 1; /*!< [0..0] Pmn Output Data                                                    */
            __IOM uint16_t PODR1  : 1; /*!< [1..1] Pmn Output Data                                                    */
            __IOM uint16_t PODR2  : 1; /*!< [2..2] Pmn Output Data                                                    */
            __IOM uint16_t PODR3  : 1; /*!< [3..3] Pmn Output Data                                                    */
            __IOM uint16_t PODR4  : 1; /*!< [4..4] Pmn Output Data                                                    */
            __IOM uint16_t PODR5  : 1; /*!< [5..5] Pmn Output Data                                                    */
            __IOM uint16_t PODR6  : 1; /*!< [6..6] Pmn Output Data                                                    */
            __IOM uint16_t PODR7  : 1; /*!< [7..7] Pmn Output Data                                                    */
            __IOM uint16_t PODR8  : 1; /*!< [8..8] Pmn Output Data                                                    */
            __IOM uint16_t PODR9  : 1; /*!< [9..9] Pmn Output Data                                                    */
            __IOM uint16_t PODR10 : 1; /*!< [10..10] Pmn Output Data                                                  */
            __IOM uint16_t PODR11 : 1; /*!< [11..11] Pmn Output Data                                                  */
            __IOM uint16_t PODR12 : 1; /*!< [12..12] Pmn Output Data                                                  */
            __IOM uint16_t PODR13 : 1; /*!< [13..13] Pmn Output Data                                                  */
            __IOM uint16_t PODR14 : 1; /*!< [14..14] Pmn Output Data                                                  */
            __IOM uint16_t PODR15 : 1; /*!< [15..15] Pmn Output Data                                                  */
        } PODR_b;
    };

    union
    {
        __IOM uint16_t PDR;            /*!< (@ 0x00000002) Pmn Direction Register                                     */

        struct
        {
            __IOM uint16_t PDR0  : 1;  /*!< [0..0] Pmn Direction                                                      */
            __IOM uint16_t PDR1  : 1;  /*!< [1..1] Pmn Direction                                                      */
            __IOM uint16_t PDR2  : 1;  /*!< [2..2] Pmn Direction                                                      */
            __IOM uint16_t PDR3  : 1;  /*!< [3..3] Pmn Direction                                                      */
            __IOM uint16_t PDR4  : 1;  /*!< [4..4] Pmn Direction                                                      */
            __IOM uint16_t PDR5  : 1;  /*!< [5..5] Pmn Direction                                                      */
            __IOM uint16_t PDR6  : 1;  /*!< [6..6] Pmn Direction                                                      */
            __IOM uint16_t PDR7  : 1;  /*!< [7..7] Pmn Direction                                                      */
            __IOM uint16_t PDR8  : 1;  /*!< [8..8] Pmn Direction                                                      */
            __IOM uint16_t PDR9  : 1;  /*!< [9..9] Pmn Direction                                                      */
            __IOM uint16_t PDR10 : 1;  /*!< [10..10] Pmn Direction                                                    */
            __IOM uint16_t PDR11 : 1;  /*!< [11..11] Pmn Direction                                                    */
            __IOM uint16_t PDR12 : 1;  /*!< [12..12] Pmn Direction                                                    */
            __IOM uint16_t PDR13 : 1;  /*!< [13..13] Pmn Direction                                                    */
            __IOM uint16_t PDR14 : 1;  /*!< [14..14] Pmn Direction                                                    */
            __IOM uint16_t PDR15 : 1;  /*!< [15..15] Pmn Direction                                                    */
        } PDR_b;
    };
    __IM uint16_t RESERVED;

    union
    {
        __IM uint16_t PIDR;            /*!< (@ 0x00000006) Pmn State Register                                         */

        struct
        {
            __IM uint16_t PIDR0  : 1;  /*!< [0..0] Pmn State                                                          */
            __IM uint16_t PIDR1  : 1;  /*!< [1..1] Pmn State                                                          */
            __IM uint16_t PIDR2  : 1;  /*!< [2..2] Pmn State                                                          */
            __IM uint16_t PIDR3  : 1;  /*!< [3..3] Pmn State                                                          */
            __IM uint16_t PIDR4  : 1;  /*!< [4..4] Pmn State                                                          */
            __IM uint16_t PIDR5  : 1;  /*!< [5..5] Pmn State                                                          */
            __IM uint16_t PIDR6  : 1;  /*!< [6..6] Pmn State                                                          */
            __IM uint16_t PIDR7  : 1;  /*!< [7..7] Pmn State                                                          */
            __IM uint16_t PIDR8  : 1;  /*!< [8..8] Pmn State                                                          */
            __IM uint16_t PIDR9  : 1;  /*!< [9..9] Pmn State                                                          */
            __IM uint16_t PIDR10 : 1;  /*!< [10..10] Pmn State                                                        */
            __IM uint16_t PIDR11 : 1;  /*!< [11..11] Pmn State                                                        */
            __IM uint16_t PIDR12 : 1;  /*!< [12..12] Pmn State                                                        */
            __IM uint16_t PIDR13 : 1;  /*!< [13..13] Pmn State                                                        */
            __IM uint16_t PIDR14 : 1;  /*!< [14..14] Pmn State                                                        */
            __IM uint16_t PIDR15 : 1;  /*!< [15..15] Pmn State                                                        */
        } PIDR_b;
    };

    union
    {
        __OM uint16_t PORR;            /*!< (@ 0x00000008) Pmn Output Reset Register                                  */

        struct
        {
            __OM uint16_t PORR0  : 1;  /*!< [0..0] Pmn Output Reset                                                   */
            __OM uint16_t PORR1  : 1;  /*!< [1..1] Pmn Output Reset                                                   */
            __OM uint16_t PORR2  : 1;  /*!< [2..2] Pmn Output Reset                                                   */
            __OM uint16_t PORR3  : 1;  /*!< [3..3] Pmn Output Reset                                                   */
            __OM uint16_t PORR4  : 1;  /*!< [4..4] Pmn Output Reset                                                   */
            __OM uint16_t PORR5  : 1;  /*!< [5..5] Pmn Output Reset                                                   */
            __OM uint16_t PORR6  : 1;  /*!< [6..6] Pmn Output Reset                                                   */
            __OM uint16_t PORR7  : 1;  /*!< [7..7] Pmn Output Reset                                                   */
            __OM uint16_t PORR8  : 1;  /*!< [8..8] Pmn Output Reset                                                   */
            __OM uint16_t PORR9  : 1;  /*!< [9..9] Pmn Output Reset                                                   */
            __OM uint16_t PORR10 : 1;  /*!< [10..10] Pmn Output Reset                                                 */
            __OM uint16_t PORR11 : 1;  /*!< [11..11] Pmn Output Reset                                                 */
            __OM uint16_t PORR12 : 1;  /*!< [12..12] Pmn Output Reset                                                 */
            __OM uint16_t PORR13 : 1;  /*!< [13..13] Pmn Output Reset                                                 */
            __OM uint16_t PORR14 : 1;  /*!< [14..14] Pmn Output Reset                                                 */
            __OM uint16_t PORR15 : 1;  /*!< [15..15] Pmn Output Reset                                                 */
        } PORR_b;
    };

    union
    {
        __OM uint16_t POSR;            /*!< (@ 0x0000000A) Pmn Output Set Register                                    */

        struct
        {
            __OM uint16_t POSR0  : 1;  /*!< [0..0] Pmn Output Set                                                     */
            __OM uint16_t POSR1  : 1;  /*!< [1..1] Pmn Output Set                                                     */
            __OM uint16_t POSR2  : 1;  /*!< [2..2] Pmn Output Set                                                     */
            __OM uint16_t POSR3  : 1;  /*!< [3..3] Pmn Output Set                                                     */
            __OM uint16_t POSR4  : 1;  /*!< [4..4] Pmn Output Set                                                     */
            __OM uint16_t POSR5  : 1;  /*!< [5..5] Pmn Output Set                                                     */
            __OM uint16_t POSR6  : 1;  /*!< [6..6] Pmn Output Set                                                     */
            __OM uint16_t POSR7  : 1;  /*!< [7..7] Pmn Output Set                                                     */
            __OM uint16_t POSR8  : 1;  /*!< [8..8] Pmn Output Set                                                     */
            __OM uint16_t POSR9  : 1;  /*!< [9..9] Pmn Output Set                                                     */
            __OM uint16_t POSR10 : 1;  /*!< [10..10] Pmn Output Set                                                   */
            __OM uint16_t POSR11 : 1;  /*!< [11..11] Pmn Output Set                                                   */
            __OM uint16_t POSR12 : 1;  /*!< [12..12] Pmn Output Set                                                   */
            __OM uint16_t POSR13 : 1;  /*!< [13..13] Pmn Output Set                                                   */
            __OM uint16_t POSR14 : 1;  /*!< [14..14] Pmn Output Set                                                   */
            __OM uint16_t POSR15 : 1;  /*!< [15..15] Pmn Output Set                                                   */
        } POSR_b;
    };

    union
    {
        __IOM uint16_t EORR;           /*!< (@ 0x0000000C) Pmn Event Output Reset Register                            */

        struct
        {
            __IOM uint16_t EORR0  : 1; /*!< [0..0] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR1  : 1; /*!< [1..1] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR2  : 1; /*!< [2..2] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR3  : 1; /*!< [3..3] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR4  : 1; /*!< [4..4] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR5  : 1; /*!< [5..5] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR6  : 1; /*!< [6..6] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR7  : 1; /*!< [7..7] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR8  : 1; /*!< [8..8] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR9  : 1; /*!< [9..9] Pmn Event Output Reset                                             */
            __IOM uint16_t EORR10 : 1; /*!< [10..10] Pmn Event Output Reset                                           */
            __IOM uint16_t EORR11 : 1; /*!< [11..11] Pmn Event Output Reset                                           */
            __IOM uint16_t EORR12 : 1; /*!< [12..12] Pmn Event Output Reset                                           */
            __IOM uint16_t EORR13 : 1; /*!< [13..13] Pmn Event Output Reset                                           */
            __IOM uint16_t EORR14 : 1; /*!< [14..14] Pmn Event Output Reset                                           */
            __IOM uint16_t EORR15 : 1; /*!< [15..15] Pmn Event Output Reset                                           */
        } EORR_b;
    };

    union
    {
        __IOM uint16_t EOSR;           /*!< (@ 0x0000000E) Pmn Event Output Set Register                              */

        struct
        {
            __IOM uint16_t EOSR0  : 1; /*!< [0..0] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR1  : 1; /*!< [1..1] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR2  : 1; /*!< [2..2] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR3  : 1; /*!< [3..3] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR4  : 1; /*!< [4..4] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR5  : 1; /*!< [5..5] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR6  : 1; /*!< [6..6] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR7  : 1; /*!< [7..7] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR8  : 1; /*!< [8..8] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR9  : 1; /*!< [9..9] Pmn Event Output Set                                               */
            __IOM uint16_t EOSR10 : 1; /*!< [10..10] Pmn Event Output Set                                             */
            __IOM uint16_t EOSR11 : 1; /*!< [11..11] Pmn Event Output Set                                             */
            __IOM uint16_t EOSR12 : 1; /*!< [12..12] Pmn Event Output Set                                             */
            __IOM uint16_t EOSR13 : 1; /*!< [13..13] Pmn Event Output Set                                             */
            __IOM uint16_t EOSR14 : 1; /*!< [14..14] Pmn Event Output Set                                             */
            __IOM uint16_t EOSR15 : 1; /*!< [15..15] Pmn Event Output Set                                             */
        } EOSR_b;
    };
} R_PORT0_Type;                        /*!< Size = 16 (0x10)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_PORGA                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Product Organize Register (R_PORGA)
 */

